//Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

Console.Write("Введите трехзначное число ");
int x = Convert.ToInt32(Console.ReadLine()); //123

int x1 = x%100; //23
int x2 = x1%10; //3

int result = (x1 - x2) / 10;
Console.WriteLine("Вторая цифра введенного числа: " + result);